khoih-prog/ESP32_SC_W6100_Manager/src/ESP32_SC_W6100_Manager.hpp
const char EM_HTTP_FORM_LABEL[] PROGMEM = "<label for='{i}'>{p}</label>";
const char EM_HTTP_FORM_PARAM[] PROGMEM = "<input id='{i}' name='{n}' length={l} placeholder='{p}' value='{v}' {c}>";

const char EM_HTTP_FORM_END[] PROGMEM = "<button class='btn' type='submit'>Save</button></form>";

////////////////////////////////////////////////////

const char EM_HTTP_SAVED[] PROGMEM = "<div class='msg'><b>Credentials Saved</b></div>";

////////////////////////////////////////////////////

const char EM_HTTP_END[] PROGMEM = "</div></body></html>";

////////////////////////////////////////////////////

const char EM_HTTP_HEAD_CL[]         = "Content-Length";
const char EM_HTTP_HEAD_CT[]         = "text/html";
const char EM_HTTP_HEAD_CT2[]        = "text/plain";

const char EM_HTTP_HEAD_JSON[]       ="application/json";

//KH Add repeatedly used const
const char EM_HTTP_CACHE_CONTROL[]   = "Cache-Control";
const char EM_HTTP_NO_STORE[]        = "no-cache, no-store, must-revalidate";
const char EM_HTTP_PRAGMA[]          = "Pragma";
const char EM_HTTP_NO_CACHE[]        = "no-cache";
const char EM_HTTP_EXPIRES[]         = "Expires";
const char EM_HTTP_CORS[]            = "Access-Control-Allow-Origin";
const char EM_HTTP_CORS_ALLOW_ALL[]  = "*";

////////////////////////////////////////////////////

#if USE_AVAILABLE_PAGES
  const char EM_HTTP_AVAILABLE_PAGES[] PROGMEM = "<h3>Available Pages</h3><table class='table'><thead><tr><th>Page</th><th>Function</th></tr></thead><tbody><tr><td><a href='/'>/</a></td><td>Menu page.</td></tr><tr><td><a href='/eth'>/eth</a></td><td>Enter ETH Config Page</td></tr><tr><td><a href='/ethsave'>/ethsave</a></td><td>Save Config. Portal Info with supplied variables.</td></tr><tr><td><a href='/close'>/close</a></td><td>Close the Config Portal.</td></tr><tr><td><a href='/i'>/i</a></td><td>This Info page.</td></tr><tr><td><a href='/r'>/r</a></td><td>Delete ETH configuration and reboot.</td></tr><tr><td><a href='/state'>/state</a></td><td>Current device state in JSON format. Interface for ETH configuration.</td></tr></table>";
#else
  const char EM_HTTP_AVAILABLE_PAGES[] PROGMEM = "";
#endif

////////////////////////////////////////////////////

#define ETH_MANAGER_MAX_PARAMS 20

////////////////////////////////////////////////////

// To permit autoConnect() to use STA static IP or DHCP IP.
#ifndef AUTOCONNECT_NO_INVALIDATE
  #define AUTOCONNECT_NO_INVALIDATE true
#endif

////////////////////////////////////////////////////

typedef struct
{
  const char *_id;
  const char *_placeholder;
  char       *_value;
  int         _length;
  int         _labelPlacement;
}  EMParam_Data;


////////////////////////////////////////////////////
////////////////////////////////////////////////////

class ESP32_EMParameter 
{
  public:
  
    ESP32_EMParameter(const char *custom);
    ESP32_EMParameter(const char *id, const char *placeholder, const char *defaultValue, const int& length, 
                      const char *custom = "", const int& labelPlacement = WFM_LABEL_BEFORE);
                                           
    ESP32_EMParameter(const EMParam_Data& EMParam_data);                      
    
    ~ESP32_EMParameter();
    
    void setEMParam_Data(const EMParam_Data& EMParam_data);
    void getEMParam_Data(EMParam_Data& EMParam_data);
 
    const char *getID();
    const char *getValue();
    const char *getPlaceholder();
    int         getValueLength();
    int         getLabelPlacement();
    const char *getCustomHTML();
    
  private:
  
    EMParam_Data _EMParam_data;
    
    const char *_customHTML;

    void init(const char *id, const char *placeholder, const char *defaultValue, const int& length, 
              const char *custom, const int& labelPlacement);

    friend class ESP32_SC_W6100_Manager;
};

////////////////////////////////////////////////////

#define USE_DYNAMIC_PARAMS        true
#define DEFAULT_PORTAL_TIMEOUT    60000L

// To permit disable/enable StaticIP configuration in Config Portal from sketch. Valid only if DHCP is used.
// You have to explicitly specify false to disable the feature.
#ifndef USE_STATIC_IP_CONFIG_IN_CP
  #define USE_STATIC_IP_CONFIG_IN_CP          true
#endif

////////////////////////////////////////////////////
////////////////////////////////////////////////////

class ESP32_SC_W6100_Manager
{
  public:

    ESP32_SC_W6100_Manager(const char *iHostname = "");

    ~ESP32_SC_W6100_Manager();
    
    // If you want to start the config portal
    bool          startConfigPortal();

    //sets timeout before webserver loop ends and exits even if there has been no setup.
    //usefully for devices that failed to connect at some point and got stuck in a webserver loop
    //in seconds setConfigPortalTimeout is a new name for setTimeout
    void          setConfigPortalTimeout(const unsigned long& seconds);
    void          setTimeout(const unsigned long& seconds);

    //sets timeout for which to attempt connecting, usefull if you get a lot of failed connects
    void          setConnectTimeout(const unsigned long& seconds);

    void          setDebugOutput(bool debug);
          
    //sets config for a static IP
    void          setSTAStaticIPConfig(const IPAddress& ip, const IPAddress& gw, const IPAddress& sn);
    
    void          setSTAStaticIPConfig(const ETH_STA_IPConfig& EM_STA_IPconfig);
    void          getSTAStaticIPConfig(ETH_STA_IPConfig& EM_STA_IPconfig);

#if USE_CONFIGURABLE_DNS
    void          setSTAStaticIPConfig(const IPAddress& ip, const IPAddress& gw, const IPAddress& sn,
                                       const IPAddress& dns_address_1, const IPAddress& dns_address_2);
#endif
   
    //called when settings have been changed and connection was successful
    void          setSaveConfigCallback(void(*func)());

#if USE_DYNAMIC_PARAMS
    //adds a custom parameter
    bool          addParameter(ESP32_EMParameter *p);
#else
    //adds a custom parameter
    void          addParameter(ESP32_EMParameter *p);
#endif

    //if this is set, it will exit after config, even if connection is unsucessful.
    void          setBreakAfterConfig(bool shouldBreak);
    
    //if this is set, try WPS setup when starting (this will delay config portal for up to 2 mins)
    //TODO
    //if this is set, customise style
    void          setCustomHeadElement(const char* element);

////////////////////////////////////////////////////
    
    // For configuring CORS Header, default to EM_HTTP_CORS_ALLOW_ALL = "*"
#if USING_CORS_FEATURE
    void setCORSHeader(const char* CORSHeaders)
    {     
      _CORS_Header = CORSHeaders;

      LOGWARN1(F("Set CORS Header to : "), _CORS_Header);
    }

    ///////////////////////////
     
    inline const char* getCORSHeader()
    {
      return _CORS_Header;
    }
#endif     

    ///////////////////////////
 
    //returns the list of Parameters
    ESP32_EMParameter** getParameters();
    
    // returns the Parameters Count
    int getParametersCount();

    ///////////////////////////
 
    void setHostname()
    {
      if (RFC952_hostname[0] != 0)
      {
		    ETH.setHostname(RFC952_hostname);   
      }
    }

////////////////////////////////////////////////////
 
